{"pageProps":{"post":{"title":"IE Button Bug","date":"2010-09-05","contentHTML":"<p>I recently encountered an annoying bug in multiple versions of IE regarding forms and button elements. I am writing about it to remind myself in the future and to hopefully save time for someone else. The bug spawned from my decision to use <code>&lt;button&gt;</code> elements over <code>&lt;input type=&quot;submit&quot;&gt;</code> elements as the submit buttons for my forms. I chose button elements because they are generally more consistent in cross browser rendering and also allow for more semantic textual content than text in the input element&#39;s type attribute.\nThe behavior of modern browsers matched my own expected behavior. That is:</p>\n<p>if a from element contains a button element, and no input <code>type=&#39;submit&#39;</code>, that button should trigger the submit event of the form</p>\n<p>However, IE does not.</p>\n<p>&quot;IE will not fire a form submit event on a <code>&lt;button&gt;&lt;/button&gt;</code> click by default.&quot;</p>\n<p>I found this out after testing in IE and discovering that none of the forms on a site would submit. I first assumed that it was some bug with an inline validation plugin that I had used. The submission bug remained after disabling the plugin.</p>\n<p>Solutions to this bug were: </p>\n<p>Replace all the button elements with input <code>type=&#39;submit&#39;</code> and apply the button styles. \nOr attach an explicit click event to the button elements that would fire the parent form elements submit event.</p>\n","excerpt":"I recently encountered an annoying bug in multiple versions of IE regarding forms and button elements. I am writing about it to remind myself in the future and to hopefully save time for someone else. The bug spawned from my decision to use <button> elements over <input type=\"submit\"> elements as the submit buttons for my forms. I chose button ele...","slug":"2010/09/05/IE-button-bug","meta":{"title":"IE Button Bug- Kev Zettler","keywords":null,"image":"img/kev.jpeg","description":"I recently encountered an annoying bug in multiple versions of IE regarding forms and button elements. I am writing about it to remind myself in the future and to hopefully save time for someone else. The bug spawned from my decision to use &lt;button&gt; elements over &lt;input type=&quot;submit&qu"}}},"__N_SSG":true}