{"pageProps":{"post":{"title":"Dasung Paperlike Pro(grammer) Review","date":"2018-01-12","contentHTML":"<p>I recently purchased a <a href=\"http://www.dasung.com/english/\">Dasung Paperlike Pro 13.3 E-ink monitor</a> to use for coding, reading, and terminal work. I have many thoughts on the overall e-ink market and consumer experience. I will save them for another post. This post will be brief and focused on personal expectations with the Dasung. Additionally, there are <a href=\"https://www.youtube.com/results?search_query=dasung+paperlike+pro\">many other, more thorough reviews</a> online demonstrating the capabilities of the monitor.</p>\n<p>After telling people I purchased this monitor the common reaction is:</p>\n<blockquote><p>&#34;E-ink? Isn&#39;t that slow!? How do you code on that?&#34; - Tech Friend</p>\n</blockquote>\n<p>This is an understandable concern as most people&#39;s personal experience with E-ink has been on smaller low powered devices like Kindles or other E-readers.  The smaller e-reader screens tend to have an extended &#39;refresh&#39; rate built in. This is an attempt to conserve battery power.</p>\n<p>The Dasung doesn&#39;t have to make this compromise; it has a dedicated power source. The Dasung monitor performance runs at about 40 FPS on HDMI hookup. This thing can play videos.</p>\n<h2>Coding in Emacs on a Dasung Paperlike Pro 13.3 E-ink monitor</h2>\n<p>Below is a video I sent to a few friends demonstrating the responsiveness and performance</p>\n<p>e-ink emacs video:</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/zp8-eUmAnhg\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe><h2>The pros</h2>\n<ul><li>The overall physical design and form factor of the monitor is great.<p>The monitor has a solid one-piece construction. As a bonus, it comes with a stand. HDMI hookup</p>\n</li>\n<li>Works excellent for Emacs.<p>Can be a dedicated Emacs monitor.</p>\n</li>\n<li>Dasung support was fast, friendly and shipping was quick.</li>\n</ul>\n<h3>Dasung driver and software performance</h3>\n<p>Dasung packages software to help drive and configure the monitor on popular operating systems: Windows, OSX, and 64bit Ubuntu. I primarily used the monitor on an OSX system.</p>\n<p>The Monitor has three primary rendering modes: <b>Floyd</b>, <b>A2</b>, <b>A16</b>. I find myself spending most of the time in the <b>A2</b> mode. The different modes correspond to different algorithms that the monitor uses to convert the colored display pixel data into grey-scale e-ink data. The numbers in the <b>A2</b> and <b>A16</b> modes are the different shades of grey each pixel will render. The <b>A2</b> mode is a hard binary contrast containing only 2 colors, black and white. I found this great for text editing and reading.</p>\n<p>The <b>A16</b> mode maps color pixels into one of 16 shades of grey. This mode is useful for viewing operating system UI and Apps that don&#39;t render well in a black and white mode.</p>\n<p>The <b>Floyd</b> mode is apparently a proprietary custom Dasung algorithm that is based on <del>[[<a href=\"https://en.wikipedia.org/wiki/Floyd%E2%80%93Warshall_algorithm][The\">https://en.wikipedia.org/wiki/Floyd–Warshall_algorithm][The</a> Floyd-Warshall algorithim]]</del> <a href=\"https://en.wikipedia.org/wiki/Floyd%E2%80%93Steinberg_dithering\">Floyd–Steinberg dithering algorithim</a>. Overall the <b>Floyd</b> mode renders multi shade grey output at a high frame rate. You can watch videos in this mode. Wikipedia states that:</p>\n<blockquote><p><del>the Floyd–Warshall algorithm is an algorithm for finding shortest paths in a weighted graph with positive or negative edge weights (but with no negative cycles).</del></p>\n</blockquote>\n<p>I am not sure how Dasung applies that graph pathfinding algorithm to the pixel data of the display output. I haven&#39;t thought too hard about this yet, I would appreciate any ideas left in the comments below.</p>\n<h2>The cons</h2>\n<h3>Reflective screen glare</h3>\n<p>As you can see in the video above, there is an obvious glare on the screen. The video was captured in a moderately lit room. The monitor actually ships with a plastic anti-glare protective screen cover to help alleviate this. This is a huge problem and defeats the purpose of the monitor. Dasung&#39;s advertising is aggressive on claims of &#34;Relax Your Eyes&#34;, &#34;Ultimate Eye Protection&#34; &#34;No blue light, No flashing, No backlight, No glossy&#34;.</p>\n<p>Unfortunately, putting a reflective pane of glass over the e-ink display is a bad move.</p>\n<h3>Dasung driver and software issues</h3>\n<p>I listed the Dasung software as a Pro, unfortunately, it also has some frustrating issues. Again my experience was on MacOSX; your experience may be different.</p>\n<p>The monitor has a &#34;change mode&#34; hardware button that lets you cycle through these differnt modes. There is a software driver UI that also changes these modes. It seems the software can get out of sync with the hardware. You can set a resolution and contrast and mode in the software, Then press a hardware button and that resolution will be lost.</p>\n<p>At times the monitor goes in to some kind of &#34;sleep mode&#34; even while plugged into an active computer. The screen goes black and unresponsive. By messing with a combination of the hardware buttons on the screen you can wake it up.</p>\n<p>Unfortunatly, the driver UI defaults to Chinese, I was able to navigate it blindly and change to English. It should detect the operating system&#39;s language setting.</p>\n<h1>Summary</h1>\n<p>Overall I think the Dasung is a pretty awesome piece of equipment. I am majorly dissapointed about the reflective glass screen. I am happy with my purchase and hope funds go to help further improve the company and product line. If you spend a lot of time editing text or reading with tired eyes I would recommend one. You can use it as a dedicated text editor or terminal screen to great success.</p>\n<h1>Updates</h1>\n<h2>2018/02/02:</h2>\n[[<a href=\"https://kevzettler.com/2018/01/12/dasung-paperlike-pro-review#comment-3754833721\">https://kevzettler.com/2018/01/12/dasung-paperlike-pro-review#comment-3754833721</a>][Jon Hendry]] in the comments pointed out that the Dasung PaperlikePro Floyd mode is probably the <a href=\"https://en.wikipedia.org/wiki/Floyd%E2%80%93Steinberg_dithering\">Floyd–Steinberg dithering algorithim</a> and not the Floyd-Warshall I pointed out above. This makes much more sense I have updated the content above","excerpt":"I recently purchased a Dasung Paperlike Pro 13.3 E-ink monitor to use for coding, reading, and terminal work. I have many thoughts on the overall e-ink market and consumer experience. I will save them for another post. This post will be brief and focused on personal expectations with the Dasung. Additionally, there are many other, more thorough reviews online demonstrating the capabilities of the ...","slug":"2018/01/12/dasung-paperlike-pro-review","meta":{"keywords":"e-ink hardware workflow","image":"img/kev.jpeg","description":"I recently purchased a Dasung Paperlike Pro 13.3 E-ink monitor to use for coding, reading, and terminal work. I have many thoughts on the overall e-ink market and consumer experience. I will save them for another post. This post will be brief and focused on personal expectations with the Dasung. Add","title":"Dasung Paperlike Pro(grammer) Review - Kev Zettler"}}},"__N_SSG":true}