{"pageProps":{"post":{"title":"Dasung Paperlike Pro Teardown","date":"2018-02-11","contentHTML":"<img src='/img/dasung_teardown/title.png'\n alt='Dasung Paperlike Pro control board says. Oops, you have lost the warranty :-('\n title='Dasung Paperlike Pro control board says. Oops, you have lost the warranty :-('\n/><blockquote><p><b>Disclaimer</b> This is my first real electronics, hardware project. I&#39;m picking this up as I go. I don&#39;t yet have a mature mental model on electronics. I appreciate any guidance and coaching in the comments.</p>\n</blockquote>\n<h2>Building a DIY E-ink or Epaper laptop</h2>\n<p>This is a follow up to my previous <a href=\"/2018/01/12/dasung-paperlike-pro-review\">Dasung Paperlike Pro Review</a> post. For visitors landing here, a quick recap. The Dasung Paperlike Pro is billed as &#34;The worlds first HDMI e-ink monitor&#34; It is high performance for a e-ink display and renders at about 40fps. Check the review post for more info.</p>\n<p>I Bought the Dasung with intentions to tear it down for &#39;research&#39; purposes. Mainly to confirm what e-ink display module they were using. This research was for the goal of building an <a href=\"https://www.youtube.com/watch?v=4-cVNJwhAqo\">e-ink laptop</a>. In this post I will walk through my experience dismantling the Dasung and discuss its internal components. Hopefully readers will find this useful in their own e-ink hardware projects, or in the chance they need to repair a Dasung.</p>\n<p>You can click through any of the images below for full high res versions.</p>\n<h2>How to open the Dasung Paperlike Pro</h2>\n<p>The Dasung has a seemingly, solid one piece construction. It took me a few days to devise a method of disassembly that wasn&#39;t aggressively destructive, like cracking the frame open with a hammer, or pry-bar. After prodding it for a few days I discovered the front outer frame bezel was glued on and could be pried with a knife.</p>\n<a href='/img/dasung_teardown/2017-12-26 19.49.20.jpg'>\n  <img src='/img/dasung_teardown/2017-12-26 19.49.20.jpg' alt=\"How to remove Dasung Paperlike Pro faceplate\" title=\"How to remove Dasung Paperlike Pro faceplate\" />\n</a><a href='/img/dasung_teardown/2017-12-26 19.49.39.jpg'>\n  <img src='/img/dasung_teardown/2017-12-26 19.49.39.jpg' alt=\"How to remove Dasung Paperlike Pro faceplate\" title=\"How to remove Dasung Paperlike Pro faceplate\" />\n</a><a href='/img/dasung_teardown/2017-12-26 19.52.19.jpg' >\n  <img src='/img/dasung_teardown/2017-12-26 19.52.19.jpg' title=\"How to dissasemble Dasung Paperlike Pro\" alt=\"How to dissasemble Dasung Paperlike Pro\" />\n</a><a href='/img/dasung_teardown/2017-12-26 19.54.26.jpg'>\n  <img src='/img/dasung_teardown/2017-12-26 19.54.26.jpg' alt=\"How to unscrew Dasung Paperlike Pro\" title=\"How to unscrew Dasung Paperlike Pro dissasembly\" />\n</a><h2>The Dasung E-ink display module</h2>\n<p>My main objective in purchasing the Dasung, was to confirm what e-ink display module was in use. I had suspected it was the <a href=\"http://shopkits.eink.com/product/13-3%CB%9D-epaper-display-ed133ut2/\">13.3˝ ePaper Display (ED133UT2)</a> However other notes from Dasung about a &#34;Carta&#34; version change lead me to doubt that. One of my biggest complaints in my <a href=\"2018/01/12/dasung-paperlike-pro-review\">Dasung Paperlike Pro Review</a> post, was that the monitor display was reflective and has an aggressive glare.</p>\n<a href='/img/dasung_teardown/2017-12-26 19.56.24.jpg'>\n  <img src='/img/dasung_teardown/2017-12-26 19.56.24.jpg' alt=\"\" title=\"\" />\n</a><h3>Detaching the E-ink display module</h3>\n<p>This step was sensitive. The Display module is attached by a fragile ribbon cable to a latch bracket. This is called a ZIF (Zero Insertion Force) connector. It took me a bit to track down how to open it. You Lift the black latch off and can remove the ribbon cable.</p>\n<a href='/img/dasung_teardown/2017-12-26 20.28.23.jpg'>\n  <img src='/img/dasung_teardown/2017-12-26 20.28.23.jpg' alt=\"How to open ZIF (Zero Insertion Force) connector\" title=\"How to open ZIF (Zero Insertion Force) connector\" />\n</a><a href='/img/dasung_teardown/2017-12-26 21.21.55.jpg'>\n  <img src='/img/dasung_teardown/2017-12-26 21.21.55.jpg' alt=\"\" title=\"\" />\n</a><h3>Reviewing the E-ink Epaper display module</h3>\n<p>On inspection of the E-ink display module I was disappointed to find that the glass was actually part of the module and not a separate pane like I first expected and hoped.</p>\n<a href='/img/dasung_teardown/2018-02-07 19.31.52.jpg'>\n  <img src='/img/dasung_teardown/2018-02-07 19.31.52.jpg' alt=\"Broken glass on dasung e-ink display module\" title=\"borken glass on dasung e-ink module\" />\n</a><a href='/img/dasung_teardown/2018-02-07 19.30.16.jpg'>\n  <img src='/img/dasung_teardown/2018-02-07 19.30.16.jpg' alt=\"e-ink module identification\" title=\"e-ink module identification\" />\n</a><p>The tag on the display module has a model number <b>ED133UT2</b> that confirms my suspicious of it being the <a href=\"http://shopkits.eink.com/product/13-3%CB%9D-epaper-display-ed133ut2/\">e-ink 13.3 ed133ut2</a>. This is unfortunate as it appears that E-ink  offers another module the <b>ES133UT2</b> model. Note that the difference between the model numbers is the <b>S</b> and <b>D</b>. The <b>S</b> model is marketed as &#34;Flexible&#34; and has sales points of:</p>\n<ul><li>Antiglare hard-coated front-surface</li>\n<li>Plastic substrate</li>\n</ul>\n<p>It is hugely disappointing that Dasung went with the <b>D</b> model as I suspect the <b>S</b> model would be an <a href=\"http://shopkits.eink.com/product/13-3%CB%9D-epaper-display-es133ut2/\">anti-glare e-ink display module</a> solving a major problem with the Dasung. I could almost see a mistake being made during production ordering because of the very close model identifiers.</p>\n<p>On further exploration of these model numbers I found a <a href=\"http://www.panelook.com/product_cat.php?catid=73&pl=photo&st=&tag=74&panel_size_inch=1330\">PaneLook.com a whole sale display panel site</a> which lists other 13.3 e paper, display models:</p>\n<ul><li><b>EN133UT1</b></li>\n<li><b>ES133UT1</b></li>\n<li><b>ED133UT1</b></li>\n<li><b>ED133TT1</b></li>\n<li><b>ES133TT2</b></li>\n<li><b>ES133TE1</b></li>\n<li><b>ED133UT2</b></li>\n<li><b>ES133TT3</b></li>\n</ul>\n<p>Panelook curiously does not have a listing for <b>ES133UT2</b></p>\n<p>A <a href=\"http://www.panelook.com/modelcompare.php?ids=25596,25552,25553,27057,27058,27059,31868,31869\">comparison of 13.3 epaper displays</a> on PaneLook shows some interesting details about the available options.</p>\n<ul><li>The <b>ES133TE1</b> has embbed touch screen capabilities.</li>\n<li><b>EN133UT1</b> and <b>ES133TT3</b> are the only models listed with &#39;Antiglare&#39;</li>\n</ul>\n<p>After comparing these options it looks as if <b>ES133TT3</b> would be the best Epaper laptop display from these options.</p>\n<h2>The Control Board</h2>\n<p>When I first saw this control board I was shocked at how large it is and how many components are packed into it. I had assumed that most of the proprietary Dasung functionality was handled in software.</p>\n<a href='/img/dasung_teardown/2017-12-26 21.33.30.jpg' >\n  <img src='/img/dasung_teardown/2017-12-26 21.33.30.jpg' alt=\"Dasung Paperlike control board\" title=\"Dasung Paperlike Pro control board\" />\n</a><p>On closer inspection all the chip components have had their labels chemically peeled off to prevernt reverse engineering.</p>\n<h3>Two PCBs ?</h3>\n<p>There are actually two PCBs. A smaller PCB towards the top of the enclosure is a USB port with an IC and wires hooked to the main board.</p>\n<a href='/img/dasung_teardown/2017-12-26 20.22.38.jpg' >\n  <img src='/img/dasung_teardown/2017-12-26 20.22.38.jpg' alt=\"Dasung Paperlike control board\" title=\"Dasung Paperlike Pro control board\" />\n</a><p>The Dasung manual claims that this USB port is intended to be used as an interface for a USB external lamp. Then elsewhere, on the included accessories section of a &#39;quick start&#39; sheet, it says:</p>\n<ul><li>A USB to USB cable for firmware upgrade in some emergency (non standard).</li>\n</ul>\n<p>This implies that the USB interface can used for firmware updates. I suspect with some further hacking this could be used to load custom firmware or maybe dump the existing firmware of the board.</p>\n<p>There are only two input ports to the device. The USB on top, and the mini HDMI in the bottom left.</p>\n<h1>Dasung Paperlike Pro control board components</h1>\n<p>I am way too junior in electronics to accurately identify the components of the board. I leave this as an exercise for any readers, and a learning challenge for myself. I will pursue this in future work.</p>\n<p>I reached out to some 3rd party help and the best lead I got was:</p>\n<blockquote><p>from top to bottom...\nsome kind of IO breakout, maybe an MCU for platform management, might actually be running the whole show and below is just a display controller\nmain SoC, probably contains display driver they&#39;re using for just the internal screen\nthe two little ones are DRAM\nan FPGA, used as glue logic and DMA buffer for both displays\nhighly integrated hdmi controller, handles the full spec + audio and just clocks in a frame</p>\n<p>the collection of shit in the white boxes are various power regulators for the display etc, on the far top left you have a power management controller and support circuitry, handles just about all the IC and IO voltages by the looks.</p>\n</blockquote>\n<p>Looking forward to further discussion in the comments.</p>\n<h1>Updates</h1>\n<h2>2018/02/14</h2>\n<p>User thomasjfox on <a href=\"https://hackaday.com/2018/02/14/tearing-down-a-1000-e-ink-display/#comment-4362437\">hackaday comments</a> suggests:</p>\n<blockquote><p>On the bottom left is a HDMI signal decoder that feeds directly into a FPGA with RAM chips next to it.\nThe FPGA is connected to the eink controller on the right. I couldn’t make out the largish chip above the eink controller.\nWild guess: A MCU to configure the HDMI signal decoder + eink controller.</p>\n</blockquote>\n","excerpt":"Disclaimer This is my first real electronics, hardware project. I'm picking this up as I go. I don't yet have a mature mental model on electronics. I appreciate any guidance and coaching in the comments.\n\nBuilding a DIY E-ink or Epaper laptop\nThis is a follow up to my previous Dasung Paperlike Pro Review post. For visitors landing here, a quick recap. The Dasung Paperlike Pro is billed as ...","slug":"2018/02/11/dasung-paperlike-pro-teardown","meta":{"keywords":"e-ink hardware workflow laptop","image":"img/dasung_teardown/title.png","description":"A hardware teardown of the Dasung Paperlike Pro E-ink monitor as part of a research effort to build an DIY E-ink laptop","title":"Dasung Paperlike Pro Teardown"}}},"__N_SSG":true}